Tsung/justin-v2-idempotent.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="luber-justin.dckugbigqr.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second" wait_all_sessions_end="true">
      <users interarrival="10" unit="second"></users>
    </arrivalphase>
<!--     <arrivalphase phase="2" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
 -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>


<!-- ============================================================ -->
  <sessions>
<!-- ============================================================ -->

<!-- _____________________________________ -->

    <!-- ADD CAR, CREATE RENTAL, EDIT RENTAL, DELETE RENTAL, DELETE CAR -->
    <!-- too hard to deal w concurrency issues of renting another user's rental. Instead, just edit your own rental. -->

    <session name="main_session" probability="100" type="ts_http">



      <!-- Uncomment the following to debug print your dynamic variables  -->
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>



<!-- SIGN IN -->

      <!-- Pick random user  -->
      <!-- WARNING: assumes you've seeded the db with at least 1000 users named User2, User3, ... -->
      <setdynvars sourcetype="random_number" start="2" end="10">
        <var name="random_user_number" />
      </setdynvars>

      <!-- Get home -->
      <request><http url="/" method="GET" version="1.1" /></request>

      <!-- wait while guest looks at home page -->
      <thinktime value="1" random="true"></thinktime>

      <!-- Sign in -->
      <request subst="true">
        <http 
	    url="/signin" 
	    method="POST" 
	    version="1.1" 
	    contents="session[email]=User%%_random_user_number%%@boo.com&amp;session[password]=foobar&amp;commit=Login" 
	    content_type="application/x-www-form-urlencoded" 
	    />
      </request>


<!-- ADD CAR -->

      <!-- Go to 'my cars' -->
      <request subst="true"><http url="/users/skater4%%_random_user_number%%/cars" method="GET" version="1.1" /></request>

      <!-- Go to 'make a car' page -->
      <request><http url="/cars/new" method="GET" version="1.1" /></request>

      <!-- Wait while user fills out 'new car' form -->
      <thinktime value="1" random="true"></thinktime>

      <!-- submit 'new car' form -->
      <request subst="true">
        <dyn_variable name="car_redirect" re="[Ll]ocation: (.*)\r"/>
        <http 
	    url="/cars" 
	    method="POST" 
	    version="1.1" 
	    contents="car[make]=Ford%%_random_user_number%%&amp;car[model]=Mustang&amp;car[year]=2017&amp;car[color]=Red&amp;car[license_plate]=1234567&amp;car[all_tags]=by-User%%_random_user_number%%&amp;commit=Add+Car"
	    content_type="application/x-www-form-urlencoded" 
	    />
      </request>

      <!-- follow redirect -->
      <request subst="true">
        <dyn_variable name="car_id" re='href="/cars/(.*)/edit"'/>
	<http url="%%_car_redirect%%" method="GET" version="1.1" />
      </request>

      <!-- Uncomment the following to debug print your dynamic variables  -->
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>




<!-- ADD RENTAL -->

      <!-- Click on 'post a new rental' -->
      <request><http url="/rentals/new" method="GET" version="1.1" /></request>

      <!-- Wait while user fills out 'new rental' form -->
      <thinktime value="1" random="true"></thinktime>

      <!-- submit new rental form -->
      <transaction name="new_rental_post">
      <request subst="true">
        <dyn_variable name="created_rental_url" re="[Ll]ocation: (.*)\r"/>
        <dyn_variable name="created_rental_id" re="[Ll]ocation: http://.*/rentals/(.*)\r"/>
        <http 
	    url="/rentals" 
	    method="POST" 
	    version="1.1" 
	    contents="rental[car_id]=%%_car_id%%&amp;rental[start_location]=Santa+Barbara&amp;rental[end_location]=Sunnyvale&amp;rental[start_time(2i)]=11&amp;rental[start_time(3i)]=30&amp;rental[start_time(1i)]=2017&amp;rental[start_time(4i)]=05&amp;rental[start_time(5i)]=00&amp;rental[end_time(2i)]=11&amp;rental[end_time(3i)]=30&amp;rental[end_time(1i)]=2017&amp;rental[end_time(4i)]=05&amp;rental[end_time(5i)]=00&amp;rental[price]=%%_random_user_number%%&amp;commit=Create+Rental+Post"
	    content_type="application/x-www-form-urlencoded" 
	    />
      </request>     
      </transaction>

      <!-- follow redirect -->
      <request subst="true"><http url="%%_created_rental_url%%" method="GET" version="1.1" /></request>


<!-- EDIT RENTAL (HACK: same db load as renting someone else's rental -->

      <!-- my overview -->
      <request subst="true"><http url="/users/skater4%%_random_user_number%%/overview" method="GET" version="1.1" /></request>

      <!-- my rentals --> 
      <request subst="true"><http url="/users/skater4%%_random_user_number%%/rentals" method="GET" version="1.1" /></request>

      <!-- get edit page for my rental of interest -->
      <request subst="true"><http url="/rentals/%%_created_rental_id%%/edit" method="GET" version="1.1" /></request>

      <!-- wait while I fill in the form -->
      <thinktime value="2" random="true"></thinktime>

      <!-- submit edit form --> 
      <request subst="true">
        <http 
	    url="/rentals/%%_created_rental_id%%" 
	    method="POST" 
	    version="1.1" 
	    contents="rental[car_id]=%%_car_id%%&amp;rental[start_location]=EDITED+Santa+Barbara&amp;rental[end_location]=Sunnyvale&amp;rental[start_time(2i)]=11&amp;rental[start_time(3i)]=30&amp;rental[start_time(1i)]=2017&amp;rental[start_time(4i)]=05&amp;rental[start_time(5i)]=00&amp;rental[end_time(2i)]=11&amp;rental[end_time(3i)]=30&amp;rental[end_time(1i)]=2017&amp;rental[end_time(4i)]=05&amp;rental[end_time(5i)]=00&amp;rental[price]=%%_random_user_number%%&amp;commit=Update+Rental+Post"
	    content_type="application/x-www-form-urlencoded" 
	    />
      </request>     


<!-- DELETE RENTAL -->


      <!-- wait for up to 2 seconds, user decides to delete rental -->
      <thinktime value="2" random="true"></thinktime>

      <!-- delete the rental we just created -->
      <request subst="true">
        <http url="%%_created_rental_url%%" method="DELETE">
        </http>
      </request>



<!-- DELETE CAR -->

      <!-- Go to 'my cars' -->
      <request subst="true"><http url="/users/skater4%%_random_user_number%%/cars" method="GET" version="1.1" /></request>

      <thinktime value="2" random="true"></thinktime>

      <!-- delete the car we just created -->
      <request subst="true"><http url="/cars/%%_car_id%%" method="DELETE" /></request>


      <!-- Uncomment the following to debug print your dynamic variables  -->
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>


      <!-- Log out -->
      <request subst="true">
<!--        <http url="/signout" method="POST" version="1.1" contents="_method=delete" content_type="application/x-www-form-urlencoded"/> -->
        <http url="/signout" method="DELETE" />
      </request>
    </session>





  </sessions>
</tsung>